results/MariaDB/Broadwell/throughput/noDyni-oltp.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            806820
        write:                           0
        other:                           115260
        total:                           922080
    transactions:                        57630  (960.46 per sec.)
    queries:                             922080 (15367.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0006s
    total number of events:              57630

Latency (ms):
         min:                                  0.98
         avg:                                  1.04
         max:                                  2.96
         95th percentile:                      1.16
         sum:                              59948.15

Threads fairness:
    events (avg/stddev):           57630.0000/0.00
    execution time (avg/stddev):   59.9481/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1528156
        write:                           0
        other:                           218308
        total:                           1746464
    transactions:                        109154 (1819.13 per sec.)
    queries:                             1746464 (29106.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0013s
    total number of events:              109154

Latency (ms):
         min:                                  0.98
         avg:                                  1.10
         max:                                  2.94
         95th percentile:                      1.23
         sum:                             119868.52

Threads fairness:
    events (avg/stddev):           54577.0000/1251.00
    execution time (avg/stddev):   59.9343/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2848440
        write:                           0
        other:                           406920
        total:                           3255360
    transactions:                        203460 (3390.83 per sec.)
    queries:                             3255360 (54253.23 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0010s
    total number of events:              203460

Latency (ms):
         min:                                  1.10
         avg:                                  1.18
         max:                                  3.15
         95th percentile:                      1.25
         sum:                             239666.07

Threads fairness:
    events (avg/stddev):           50865.0000/92.43
    execution time (avg/stddev):   59.9165/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3997182
        write:                           0
        other:                           571026
        total:                           4568208
    transactions:                        285513 (4758.28 per sec.)
    queries:                             4568208 (76132.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0013s
    total number of events:              285513

Latency (ms):
         min:                                  1.12
         avg:                                  1.68
         max:                                 24.97
         95th percentile:                      1.76
         sum:                             479396.26

Threads fairness:
    events (avg/stddev):           35689.1250/56.03
    execution time (avg/stddev):   59.9245/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4044180
        write:                           0
        other:                           577740
        total:                           4621920
    transactions:                        288870 (4814.08 per sec.)
    queries:                             4621920 (77025.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0032s
    total number of events:              288870

Latency (ms):
         min:                                  1.51
         avg:                                  3.32
         max:                                 36.48
         95th percentile:                      5.00
         sum:                             959310.88

Threads fairness:
    events (avg/stddev):           18054.3750/940.14
    execution time (avg/stddev):   59.9569/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4041660
        write:                           0
        other:                           577380
        total:                           4619040
    transactions:                        288690 (4810.82 per sec.)
    queries:                             4619040 (76973.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0065s
    total number of events:              288690

Latency (ms):
         min:                                  1.54
         avg:                                  6.65
         max:                                 43.25
         95th percentile:                      8.74
         sum:                            1919300.96

Threads fairness:
    events (avg/stddev):           9021.5625/335.04
    execution time (avg/stddev):   59.9782/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3876684
        write:                           0
        other:                           553812
        total:                           4430496
    transactions:                        276906 (4613.90 per sec.)
    queries:                             4430496 (73822.33 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0137s
    total number of events:              276906

Latency (ms):
         min:                                  1.74
         avg:                                 13.87
         max:                                117.62
         95th percentile:                     17.32
         sum:                            3839626.04

Threads fairness:
    events (avg/stddev):           4326.6562/246.77
    execution time (avg/stddev):   59.9942/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3675896
        write:                           0
        other:                           525128
        total:                           4201024
    transactions:                        262564 (4373.90 per sec.)
    queries:                             4201024 (69982.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0277s
    total number of events:              262564

Latency (ms):
         min:                                  1.29
         avg:                                 29.25
         max:                               3758.89
         95th percentile:                     46.63
         sum:                            7681097.96

Threads fairness:
    events (avg/stddev):           2051.2812/329.69
    execution time (avg/stddev):   60.0086/0.01